Repository: musmanmalik/xblock-group-project-v2
Catalog: group_project_v2/translations/*/LC_MESSAGES/textjs.po
Languages: ar, de_de, fr, ko_kr

source: Error refreshing statuses
ar: حدث خطأ أثناء تحديث الحالات
de_de: Fehler bei der Aktualisierung des Status
fr: Actualisation des statuts d'erreur
ko_kr: 상태를 새로 고치는 중에 오류 발생

source: Upload cancelled.
ar: تم إلغاء التحميل.
de_de: Upload abgebrochen.
fr: Téléchargement annulé.
ko_kr: 업로드가 취소되었습니다.

source: Upload cancelled by user.
ar: تم إلغاء التحميل من قبل المستخدم.
de_de: Upload von Nutzer abgebrochen.
fr: Téléchargement annulé par l'utilisateur.
ko_kr: 사용자가 업로드를 취소했습니다.

source: An error occurred while uploading your file. Please refresh the page and try again. If it still does not upload, please contact your Course TA.
ar: حدث خطأ أثناء تحميل الملف. يرجى تحديث الصفحة والمحاولة مرة أخرى. إذا لم يتم التحميل بعد، فيرجى الاتصال بمساعد مدّرس الدورة التدريبية.
de_de: Während dem Upload Ihrer Datei ist ein Fehler aufgetreten. Bitte aktualisieren Sie die Seite und versuchen Sie es erneut. Funktioniert der Upload immer noch nicht, wenden Sie sich bitte an Ihren Kurs-TA.
fr: Une erreur s'est produite lors du téléchargement de votre fichier. Veuillez actualiser la page et réessayer. Si le téléchargement échoue toujours, veuillez contacter votre chargé de cours.
ko_kr: 파일을 업로드하는 동안 오류가 발생했습니다. 페이지를 새로 고침하고 다시 시도해 보십시오. 그래도 업로드되지 않으면 강의 조교에게 문의하십시오.

source: Technical details: CSRF verification failed.
ar: التفاصيل الفنية: تعذر التحقق من CSRF.
de_de: Technische Details: CSRF-Verifizierung fehlgeschlagen.
fr: Information technique : La vérification CSRF a échoué.
ko_kr: 기술적 세부정보: CSRF 검증에 실패했습니다.

source: Technical details: 403 error.
ar: التفاصيل الفنية: خطأ 403.
de_de: Technische Details: 403 Fehler.
fr: Information technique : Erreur 403.
ko_kr: 기술적 세부정보: 403 오류.

source: Error
ar: خطأ
de_de: Fehler
fr: Erreur
ko_kr: 오류

source: Please select Teammate to review
ar: يرجى تحديد زميل في الفريق للمراجعة
de_de: Bitte wählen Sie Teammate zur Überprüfung aus
fr: Veuillez choisir le coéquipier à évaluer
ko_kr: 검토할 팀원을 선택하십시오.

source: Please select Group to review
ar: يرجى تحديد مجموعة للمراجعة
de_de: Bitte wählen Sie eine Gruppe zur Überprüfung aus
fr: Veuillez choisir le groupe à évaluer
ko_kr: 검토할 그룹을 선택하십시오.

source: Thanks for your feedback!
ar: شكرًا على ملاحظاتك!
de_de: Danke für Ihr Feedback!
fr: Merci pour vos commentaires !
ko_kr: 피드백을 보내 주셔서 감사합니다!

source: We encountered an error loading your feedback.
ar: لقد صادفنا خطأ في تحميل ملاحظاتك.
de_de: Beim Laden Ihres Feedbacks ist ein Fehler aufgetreten.
fr: Une erreur s'est produite lors du chargement de vos commentaires.
ko_kr: 피드백을 로드하는 중에 오류가 발생했습니다.

source: We encountered an error saving your feedback.
ar: لقد صادفنا خطأ في حفظ ملاحظاتك.
de_de: Beim Speichern Ihres Feedbacks ist ein Fehler aufgetreten.
fr: Une erreur s'est produite lors de la sauvegarde de vos commentaires.
ko_kr: 피드백을 저장하는 중에 오류가 발생했습니다.

source: We encountered an error.
ar: لقد صادفنا خطأ في حفظ ملاحظاتك.
de_de: Ein Fehler ist aufgetreten.
fr: Une erreur s'est produite.
ko_kr: 오류가 발생했습니다.

source: This task has been marked as complete.
ar: تم وضع علامة اكتمال على هذه المهمة.
de_de: Diese Aufgabe wurde als abgeschlossen markiert.
fr: Cette tâche a été marquée comme terminée.
ko_kr: 이 태스크는 완료된 것으로 표시되었습니다.

source: We encountered an error saving your progress.
ar: لقد صادفنا خطأ في حفظ التقدم المحرز.
de_de: Beim Speichern Ihres Fortschritts ist ein Fehler aufgetreten.
fr: Une erreur s'est produite et a empêché la sauvegarde de votre progression.
ko_kr: 진도율을 저장하는 중에 오류가 발생했습니다.

source: Resubmit
ar: إعادة الإرسال
de_de: Erneut einreichen
fr: Renvoyer
ko_kr: 다시 제출

source: Submit
ar: إرسال
de_de: Einreichen
fr: Envoyer
ko_kr: 제출
